QUESTION - 1

Following are the 5 function of pandas:-
1. DataFrame :- function used to create dataframe

In [1]:
import pandas as pd

In [2]:
pd.DataFrame({'a':[1,2,3],'b':[4,5,6],'c':[7,8,9]})

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

2. read_csv :- it is used to read the data stored in a .csv file

In [4]:
df1=pd.read_csv("fileName.csv")

3. read_excel :- it is used to read the data stored in .xlsx file

In [ ]:
df2 = pd.read_excel("filename.xlsx")

4. to_csv :- used to save a dataframe to a .csv file

In [ ]:
df1.to_csv(dataframe)

5. join :- it is used to join 2 dataframes

In [5]:
d1 = pd.DataFrame({'a':[1,2,3],'b':[4,5,6]})
d2 = pd.DataFrame({'f':[8,4,7],'e':[43,23,12]})

In [6]:
d1.join(d2,how="right")

   a  b  f   e
0  1  4  8  43
1  2  5  4  23
2  3  6  7  12

QUESTION - 2

In [7]:
df = pd.DataFrame({'a':[1,2,3],'b':[3,4,5],'c':[6,7,8]})

In [15]:
def reindex_df(df):
    new_ind = list(range(1,len(df)*2,2))
    df.index = new_ind
    return df

reindexed_df = reindex_df(df)
reindexed_df

   a  b  c
1  1  3  6
3  2  4  7
5  3  5  8

QUESTION - 3

In [30]:
df3=pd.DataFrame({'values':[10, 20, 30, 40, 50]})
df3
# df3[0]

   values
0      10
1      20
2      30
3      40
4      50

In [41]:
def sumthree(df):
    sums =0 
    for i in range(3):
        sums += df3['values'][i]
    return sums

sumthree(df3)

60

QUESTION - 4

In [42]:
df4 = pd.DataFrame({'text':["hello world",'My name is Harsh Kumar Singh','This is new world feeling','Welcome to the world of Ai']})

In [45]:
df4['Word_Count'] = df4['text'].apply(lambda x : len(x.split()))

In [47]:
df4

                           text  Word_Count
0                   hello world           2
1  My name is Harsh Kumar Singh           6
2     This is new world feeling           5
3    Welcome to the world of Ai           6

QUESTION - 5

DataFrame.size gives the no of blocks of data i.e product of rows and column,
while DataFrame.shape gives the pair of no of rows and columns in dataframe

Example:-

In [56]:
df4

                           text  Word_Count
0                   hello world           2
1  My name is Harsh Kumar Singh           6
2     This is new world feeling           5
3    Welcome to the world of Ai           6

In [54]:
df4.size

8

In [55]:
df4.shape

(4, 2)

QUESTION - 6

We use pd.read_excel("file name") function to read an excel file

QUESTION - 7

In [61]:
df = pd.DataFrame({'Email':['harsh@gmail.com',"abc@gmail.com","username@gmail.com",'lcb@gmail.com','pwskills@gmail.com','John.de@example.com']})

In [62]:
df

                 Email
0      harsh@gmail.com
1        abc@gmail.com
2   username@gmail.com
3        lcb@gmail.com
4   pwskills@gmail.com
5  John.de@example.com

In [63]:
df['Username'] = df['Email'].apply(lambda x : x.split('@')[0])

In [64]:
df

                 Email  Username
0      harsh@gmail.com     harsh
1        abc@gmail.com       abc
2   username@gmail.com  username
3        lcb@gmail.com       lcb
4   pwskills@gmail.com  pwskills
5  John.de@example.com   John.de

QUESTION - 8

In [65]:
df = pd.DataFrame({
    'A':[3,8,6,2,9],
    'B':[5,2,9,3,1],
    'C':[1,7,4,5,2]
})

In [69]:
df[(df['A'] > 5) & (df['B'] < 10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

QUESTION - 9

In [75]:
df = pd.DataFrame({
    'values':[4,5,2,10,5,7,4]
})

In [76]:
df['values'].mean()

5.285714285714286

In [77]:
df['values'].median()

5.0

In [78]:
df['values'].std()

2.563479777846623

QUESTION - 10

In [81]:
date = pd.date_range(start='2023-06-01',end='2023-06-11')
df = pd.DataFrame({
    'Date':date,
    'Sales':[3,23,1,4,5,6,2,7,15,13,17],
})

In [82]:
df

         Date  Sales
0  2023-06-01      3
1  2023-06-02     23
2  2023-06-03      1
3  2023-06-04      4
4  2023-06-05      5
5  2023-06-06      6
6  2023-06-07      2
7  2023-06-08      7
8  2023-06-09     15
9  2023-06-10     13
10 2023-06-11     17

In [88]:
df['Sales'].rolling(window=7,min_periods=1).sum()

0      3.0
1     26.0
2     27.0
3     31.0
4     36.0
5     42.0
6     44.0
7     48.0
8     40.0
9     52.0
10    65.0
Name: Sales, dtype: float64

QUESTION - 11

In [6]:
date = pd.date_range(start='2023-01-01 00:00:00',end='2023-01-05 00:00:00')
df = pd.DataFrame({'Date':date})
df

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [7]:
df['Weekday'] = df['Date'].dt.day_name()

In [8]:
df

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

QUESTION - 12

In [11]:
# date = pd.date_range(start='2022-06-01',end='2023-03-01')
date1 = pd.date_range(start='2022-06-01 12:00:00',end='2023-03-01 12:00:00', freq='D')
df=pd.DataFrame({'Date':date1})
df

                   Date
0   2022-06-01 12:00:00
1   2022-06-02 12:00:00
2   2022-06-03 12:00:00
3   2022-06-04 12:00:00
4   2022-06-05 12:00:00
..                  ...
269 2023-02-25 12:00:00
270 2023-02-26 12:00:00
271 2023-02-27 12:00:00
272 2023-02-28 12:00:00
273 2023-03-01 12:00:00

[274 rows x 1 columns]

In [13]:
df[(df['Date'] > '2023-01-01') & (df['Date'] < '2023-01-31')]

                   Date
214 2023-01-01 12:00:00
215 2023-01-02 12:00:00
216 2023-01-03 12:00:00
217 2023-01-04 12:00:00
218 2023-01-05 12:00:00
219 2023-01-06 12:00:00
220 2023-01-07 12:00:00
221 2023-01-08 12:00:00
222 2023-01-09 12:00:00
223 2023-01-10 12:00:00
224 2023-01-11 12:00:00
225 2023-01-12 12:00:00
226 2023-01-13 12:00:00
227 2023-01-14 12:00:00
228 2023-01-15 12:00:00
229 2023-01-16 12:00:00
230 2023-01-17 12:00:00
231 2023-01-18 12:00:00
232 2023-01-19 12:00:00
233 2023-01-20 12:00:00
234 2023-01-21 12:00:00
235 2023-01-22 12:00:00
236 2023-01-23 12:00:00
237 2023-01-24 12:00:00
238 2023-01-25 12:00:00
239 2023-01-26 12:00:00
240 2023-01-27 12:00:00
241 2023-01-28 12:00:00
242 2023-01-29 12:00:00
243 2023-01-30 12:00:00

QUESTION - 13

To use the basic functions of pandas first and foremost we need to import pandas .Ex:-

In [99]:
import pandas as pd